# Crear Base de Datos de SQL desde Python  - Ejemplo, un colegio

## Interesante: librería names

In [1]:
import pymysql
import numpy as np
import pandas as pd
import os
import random
import names

In [2]:
#con =connection
con = pymysql.connect(host='localhost',
                      user='root',
                      cursorclass = pymysql.cursors.DictCursor)
cursor=con.cursor()

In [3]:
sql_query = "create database if not exists entrega;"
cursor.execute(sql_query)

1

In [4]:
sql_query="use entrega;"
cursor.execute(sql_query)

0

In [5]:
sql_query = 'CREATE TABLE Alumnos (ID INT PRIMARY KEY, Nombre VARCHAR(100), Apellido VARCHAR(100), Sexo VARCHAR(6), Nacimiento INT CHECK(Nacimiento BETWEEN 1990 AND 1993));'
cursor.execute(sql_query)

0

In [6]:
sql_query = 'CREATE TABLE Profesores (ID INT PRIMARY KEY, Nombre VARCHAR(100), Apellido VARCHAR(100), Sexo VARCHAR(6), Nacimiento INT CHECK(Nacimiento BETWEEN 1945 AND 1965));'
cursor.execute(sql_query)

0

In [7]:
sql_query = 'CREATE TABLE Asignaturas (ID INT PRIMARY KEY, Nombre VARCHAR(100));'
cursor.execute(sql_query)

0

In [8]:
sql_query = 'CREATE TABLE Alumno_Asignatura (AlumnoID INT, AsignaturaID INT, FOREIGN KEY (AlumnoID) REFERENCES Alumnos(ID), FOREIGN KEY (AsignaturaID) REFERENCES Asignaturas(ID), PRIMARY KEY (AlumnoID, AsignaturaID));'
cursor.execute(sql_query)

0

In [9]:
sql_query = 'CREATE TABLE Profesor_Asignatura (ProfesorID INT, AsignaturaID INT, Convocatoria INT, FOREIGN KEY (ProfesorID) REFERENCES Profesores(ID), FOREIGN KEY (AsignaturaID) REFERENCES Asignaturas(ID), PRIMARY KEY (ProfesorID, AsignaturaID, Convocatoria));'
cursor.execute(sql_query)

0

In [10]:
sql_query = 'CREATE TABLE Notas (AlumnoID INT, AsignaturaID INT, Nota DECIMAL(4,2) CHECK (Nota <= 10.00), Curso INT, Convocatoria INT, FOREIGN KEY (AlumnoID) REFERENCES Alumnos(ID), FOREIGN KEY (AsignaturaID) REFERENCES Asignaturas(ID), PRIMARY KEY (AlumnoID, AsignaturaID, Curso, Convocatoria));'
cursor.execute(sql_query)

0

In [11]:
for i in range(1, 51): # i = 1
    sexo = random.choice(['male', 'female'])
    nombre = names.get_first_name(gender=sexo)
    apellido = names.get_last_name()
    nacimiento = random.randint(1990, 1993)
    sql_insert = f"INSERT INTO Alumnos (ID, Nombre, Apellido, Sexo, Nacimiento) VALUES ({i}, '{nombre}', '{apellido}', '{sexo}', {nacimiento});"
    cursor.execute(sql_insert)
    #print(sql_insert)

In [12]:
for i in range(1, 7): # i = 1
    sexo = random.choice(['male', 'female'])
    nombre = names.get_first_name(gender=sexo)
    apellido = names.get_last_name()
    nacimiento = random.randint(1945, 1965)
    sql_insert = f"INSERT INTO Profesores (ID, Nombre, Apellido, Sexo, Nacimiento) VALUES ({i}, '{nombre}', '{apellido}', '{sexo}', {nacimiento});"
    cursor.execute(sql_insert)
    #print(sql_insert)

In [13]:
asignaturas = ['Lengua y literatura', 'Geografía e Historia', 'Francés', 'Inglés', 'Biología','Química','Matemáticas','Física']

In [14]:
for i, asignatura in enumerate(asignaturas, 1):
    sql_insert = f"INSERT INTO Asignaturas (ID, Nombre) VALUES ({i}, '{asignatura}');"
    cursor.execute(sql_insert)
    #print(sql_insert)

In [15]:
for alumno_id in range(1, 51):
    for asignatura_id in range(1, 9):
        sql_insert = f"INSERT INTO Alumno_Asignatura (AlumnoID, AsignaturaID) VALUES ({alumno_id}, {asignatura_id});"
        cursor.execute(sql_insert)
        #print(sql_insert)

In [16]:
# Asignaciones de profesores a asignaturas
asignaciones = {1: [1, 2, 3], 2: [3, 4], 3: [5, 6], 4: [6, 7, 8], 5: [4],6: [2, 3]}

In [17]:
# Insertar datos en la tabla Profesor_Asignatura y también las convocatorias (nueva columna)
for profesor_id, asignaturas in asignaciones.items():
    for asignatura_id in asignaturas:
        for convocatoria in [1, 2, 3, 4]:  # Recorrer todas las convocatorias
            sql_insert = f"INSERT INTO Profesor_Asignatura (ProfesorID, AsignaturaID, Convocatoria) VALUES ({profesor_id}, {asignatura_id}, {convocatoria});"
            cursor.execute(sql_insert)

In [18]:
# Insertar datos en la tabla Notas para el primer curso
for alumno_id in range(1, 51):  # Para cada alumno
    for asignatura_id in range(1, 9):  # Matricular en todas las asignaturas
        for convocatoria in [1, 2]:  # En ambas convocatorias
            nota = round(random.uniform(5, 10), 2)  # Nota aleatoria entre 5 y 10
            sql_insert = f"INSERT INTO Notas (AlumnoID, AsignaturaID, Nota, Curso, Convocatoria) VALUES ({alumno_id}, {asignatura_id}, {nota}, 1, {convocatoria});"
            cursor.execute(sql_insert)

# Insertar datos en la tabla Notas para el segundo curso
for alumno_id in range(1, 51):  # Para cada alumno
    # Elegir optativas (o la asignatura 3 o la 4)
    optativa_1 = random.choice([3, 4])
    nota = round(random.uniform(5, 10), 2)  # Nota aleatoria entre 0 y 10
    sql_insert = f"INSERT INTO Notas (AlumnoID, AsignaturaID, Nota, Curso, Convocatoria) VALUES ({alumno_id}, {optativa_1}, {nota}, 2, 3);"
    cursor.execute(sql_insert)

    # Elegir optativas (o la asignatura 5 y 6 o la asignatura 7 y 8)
    optativas_2 = [5, 6] if random.choice([True, False]) else [7, 8]
    for optativa_2 in optativas_2:
        nota = round(random.uniform(5, 10), 2)  # Nota aleatoria entre 0 y 10
        sql_insert = f"INSERT INTO Notas (AlumnoID, AsignaturaID, Nota, Curso, Convocatoria) VALUES ({alumno_id}, {optativa_2}, {nota}, 2, 4);"
        cursor.execute(sql_insert)

In [19]:
#actualizar base de datos con los cambios hasta ahora
con.commit()